Tekla Open API Reference for Tekla Structures 2025
DistanceList.Remove Method
 Removes the specified item.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Remove(
	Distance item
)
Public Function Remove (
	item As Distance
) As Boolean
Parameters
item
Type: Tekla.Structures.Datatype.Distance
The item to be removed.
Return Value
Type: Boolean
A boolean value indicating whether the item was removed.
Implements
ICollection<T>.Remove(T)
Examples
 This example shows how to remove a Distance instance from a DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance[] distances = { new Distance(30.2), new Distance(40, Distance.UnitType.Inch) };
           DistanceList distanceList = new DistanceList(distances);
           // Distances can be removed by value. The first matching distance will be removed.
           bool removed = distanceList.Remove(new Distance(40, Distance.UnitType.Inch));
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace